Repository: joeDeuce/musca--
Catalog: po/*/rbot-hangman.po
Languages: fi

source: hangman game plugin - topics: play, stop
fi: hirsipuu plugin - aiheet: play, stop

source: hangman play on <channel> with word <word> => use in private chat with the bot to start a game with custom word
fi: hangman play on <kanava> with word <sana> => käytä komentoa yksityiskeskustelussa jos haluat aloittaa pelin itse keksimälläsi sanalla

source: hangman play random [with [max|min] length [<|>|== <length>]] => hangman with a random word from %{site}
fi: hangman play random [with [max|min] length [<|>|== <pituus>]] => hirsipuu satunnaisella sanalla joka on noudettu osoitteesta %{site}

source: hangman play with wordlist <wordlist> => hangman with random word from <wordlist>
fi: hangman play with wordlist <sanalista> => hirsipuu satunnaisella sanalla joka on noudettu sanalistasta <sanalista>

source: hangman stop => quits the current game
fi: hangman stop => lopettaa nykyisen pelin

source: define => seeks a definition for the previous answer using google
fi: define => etsii googlesta määritelmän edelliselle oikealle vastaukselle

source: i'm not on that channel
fi: en ole kyseisellä kanavalla

source: there's already a hangman game in progress on the channel
fi: kanavalla on jo hirsipuu -peli meneillään

source: %{nick} has started a hangman -- join the fun!
fi: %{nick} aloitti hirsipuun -- liity hupiin!

source: oh well, the answer would've been %{answer}
fi: voi rähmä, oikea vastaus olisi ollut %{answer}

source: no ongoing game
fi: ei peliä menossa

source: you nailed it!
fi: oikein meni!

source: you've killed the poor guy :(
fi: tapoit sen :(

source: go %{b}again%{b}?
fi: %{b}uudestaan?%{b}

source: wondering what that means? try ´%{prefix}define´
fi: ihmetyttääkö sana? kokeile ´%{prefix}define´

source: you got %{score} points after %{games} games
fi: sinulla on %{score} pistettä %{games} pelin jälkeen

source: you haven't played hangman, how about playing it right now? :)
fi: et ole pelannut hirsipuuta, mitä jos pelaisit vaikka nyt? :)

source: %{nick} has %{score} points after %{games} games
fi: käyttäjällä %{nick} on %{score} pistettä %{games} pelin jälkeen

source: %{nick} hasn't played hangman :(
fi: %{nick} ei ole pelannut hirsipuuta :(

source: %{games} games have been played on %{channel}
fi: kanavalla %{channel} on pelattu %{games} peliä
