Repository: joeDeuce/musca--
Catalog: po/*/rbot-dictclient.po
Languages: fr

source: Hostname or hostname:port of the DICT server used to lookup words
fr: Hostname or hostname:port du serveur DICT utilisé pour chercher les mots

source: When multiple databases reply a number of definitions that above this limit, only the database names will be listed. Otherwise, the full definitions from each database are replied
fr: Lorsque plusieurs bases de données renvoyent un nombre de definitions plus grand que cette limite, seulement le nom des bases de données sera listé. Sinon, la definition complete de chaque base de donnée sera renvoyé

source: Each definition is truncated to this length
fr: Chaques definitions seront coupé à cette taille

source: Format of headwords; <word> will be replaced with the actual word
fr: Format des mots; <word> sera remplacé par le mot actuel

source: Format of database names; <database> will be replaced with the database name
fr: Format du nom des bases de données; <database> sera remplacé par le nom de la base de donnée

source: Format of definitions. <word> will be replaced with the formatted headword, <def> will be replaced with the truncated definition, and <database> with the formatted database name
fr: Format des definitions. <word> sera remplacé par le mot formaté, <def> sera remplacé par la definition coupée, et <database> par le nom de la base de donnée

source: Format of match results. <matches> will be replaced with the formatted headwords, <database> with the formatted database name
fr: Format des resultats correspondants. <matches> sera remplacé par le mot formaté, <database> avec le nom de la base de donnée

source: An error occured connecting to the DICT server. Check the dictclient.server configuration or retry later
fr: Il y a eu une erreur lors de la conenction au serveur DICT. Verifiez la configuration du dictclient.server ou reessayez plus tard

source: A protocol error occured
fr: Il y a eu une erreur de protocole

source: An error occured
fr: Il y a eu une erreur

source: Many definitions for %{phrase} were found in %{databases}. Use 'define <phrase> from <database> to view a definition.
fr: Plusieurs definitions pour %{phrase} ont été trouvés dans %{databases}. Utilisez 'define <phrase> from <database> pour voir une definition.

source: No definition for %{phrase} found from %{database}.
fr: Aucune definition pour %{phrase} trouvée dans %{database}.

source: Nothing matched %{query} from %{database} using %{strategy}
fr: Rien ne correspond a %{query} dans %{database} en utilisant %{strategy}

source: Databases: %{list}
fr: Bases de données: %{list}

source: define <phrase> [from <database>] => Show definition of a phrase
fr: define <phrase> [from <base de donnée>] => Affiche la definition de phrase

source: match <phrase> [using <strategy>] [from <database>] => Show phrases matching the given pattern
fr: match <phrase> [using <strategy>] [from <base de donnée>] => Affiche les phrases correspondantes au schema fournit

source: dictclient databases => List databases; dictclient strategies => List strategies
fr: dictclient databases => Liste les bases de données; dictclient strategies => Liste les strategies

source: look up phrases on the configured DICT server. topics: define, match, server information
fr: affiche les phrases d'un serveur DICT. sujets: define, match, server information
