Repository: joeDeuce/musca--
Catalog: po/*/rbot-nickserv.po
Languages: fr

source: Name of the nick server (all lowercase)
fr: Nom du serveur de pseudo (tout en minuscule)

source: String to look for to see if the nick server is asking us to identify
fr: Chaine a détécter pour voir si le nick server demande de s'identifier

source: String to look for to see if the nick server is informing us that our nick is now available
fr: Chaine a détécter pour voir si le nick server nous informe que le pseudo est disponnible

source: String to look for to see if the nick server is informing us that we have identified successfully
fr: Chaine a détécter pour voir si le nick server nous informe que l'identification à reussi

source: Set to false if the nick server doesn't expect the nick as a parameter in the identify command
fr: Mettre a false si le nick server ne requiert pas le pseudo en parametre lors de l'identification

source: Seconds to wait after sending a message to nickserv, e.g. after ghosting
fr: Secondes a attendre apres avoir envoyé un message a nickserv, ex. apres un ghost

source: nickserv listnicks: lists nicknames and associated password the bot knows about - you will need config level auth access to do this one and it will reply by privmsg only
fr: nickserv listnicks: liste les pseudos et mots de passe associé au bot - vous devez configurer le niveau d'acces pour qu'il ne reponde qu'en privé

source: I'm only changing this in my database, I won't inform %{ns_nick} of the change
fr: Je change seulement dans ma base de donnée, je ne peut informer %{ns_nick} des changements

source: none known
fr: aucun de connus

source: I cannot identify for a this nick
fr: Je ne peut identifier pour ce pseudo

source: I dunno the nickserv password for the nickname %{botnick} :(
fr: J'ignore le mot de passe serveur de l'utilisateur %{botnick} :(

source: uh ... something went wrong ...
fr: uh... quelquechose est faux ...
